manoj153/STM32F1BOARD/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM1_Init(void);
                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
#define REFdebounce 150
void readChannel(uint8_t chWhat);
void trigger(void);
void buzz(uint32_t rounds);
void delayUS(uint32_t us);
void testRun(void);
void onallLED(void);
void offallLED(void);
/* Variables Start */
uint32_t dipSW 		= 0xFFFFFFFF;
uint32_t sensors 	=	0xFFFFFFFF;
uint32_t Cpysensors 	=	0xFFFFFFFF;
uint8_t miscl = 0xFF;
uint8_t Cpymiscl = 0xFF;
_Bool inverted;
_Bool test;
_Bool CH1Rly, CH2Rly, CH3Rly, CH4Rly, CH5Rly, CH6Rly, PWRORCOM = 0x0;
_Bool Mutepb;
_Bool Pmutepb = 1;
_Bool buzzorNO  = 1;
uint32_t Mute_1;
uint32_t Mute_0;
uint32_t Pmute_1;
uint32_t Pmute_0;
uint8_t slaveR;

_Bool Testpb;
_Bool TestpbState;
_Bool MutepbState;
_Bool PmutepbState;
_Bool PERMENANTMUTE = 1;
uint32_t Test_1;
uint32_t Test_0;
uint16_t count1;
uint16_t countetTIM1 = 0;

_Bool GBYP1, GBYP2, GBYP3, GBYP4, GBYP5, GBYP6;
_Bool pointRorC = 1;
uint8_t txSE[] = "SE";
/* Variables Ends*/
 void dipSWR(void);
 union  
{
  uint32_t bit_32;
  uint8_t bytes[4];
}splitbytes;
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
	
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM4_Init();
  MX_TIM1_Init();

  /* USER CODE BEGIN 2 */
	//UART TRANSMIT ON DE, (HIGH)
	
	HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_SET);
	//__HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);
	HAL_GPIO_WritePin(PWR_LED_GPIO_Port, PWR_LED_Pin, GPIO_PIN_SET);
	for(int x = 0;x <1; x++)
  {
	buzz(1);
	HAL_Delay(50);
	buzz(1);
	HAL_Delay(50);
  }
	
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		//slaveR = 0;
		//HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_RESET);
		//HAL_UART_Transmit(&huart2,txdata,6, 40);
		CH1Rly = 0x0; CH2Rly = 0x0; CH3Rly = 0x0; CH4Rly = 0x0; CH5Rly = 0x0;  CH6Rly = 0x0; PWRORCOM = 0x0;
		GBYP1 = 0x01; GBYP2 = 0x01; GBYP3 = 0x01; GBYP4= 0x01; GBYP5= 0x01; GBYP6= 0x01;
		sensors 	=	0xFFFFFFFF;
		miscl = 0xFF;
		dipSWR();
		if (((dipSW >> 0) & 1))
		{
			inverted = 1;
		}
		else
		{
			inverted = 0;
		}
		
		if (((dipSW >> 1) & 1)) //CH6 BYP switch check to see to read the value or no
		{
			readChannel(6U);
		}
		else 
		{
		if (inverted)
		{
		sensors &= ~((0) << 3);
		sensors &= ~((0) << 2);
		sensors &= ~((0) << 1);
		sensors &= ~((0) << 0);		
		}
		else		
		{
		sensors &= ~((1) << 3);
		sensors &= ~((1) << 2);
		sensors &= ~((1) << 1);
		sensors &= ~((1) << 0);	
		}
		GBYP6= 0x00;
		}
		
		if (((dipSW >> 2) & 1)) //CH5 BYP switch check to see to read the value or no
		{
			readChannel(5U);
		}
		else 
		{
		if (inverted)
		{
		sensors &= ~((0) << 7);
		sensors &= ~((0) << 6);
		sensors &= ~((0) << 5);
		sensors &= ~((0) << 4);	
		}
		else
		{
		sensors &= ~((1) << 7);
		sensors &= ~((1) << 6);
		sensors &= ~((1) << 5);
		sensors &= ~((1) << 4);	
		}
		
		GBYP5= 0x00;
		}
		
		
		if (((dipSW >> 3) & 1)) //CH4 BYP switch check to see to read the value or no
		{
			readChannel(4U);
		}
		else 
		{
			if (inverted)
			{
		sensors &= ~((0) << 11);
		sensors &= ~((0) << 10);
		sensors &= ~((0) << 9);
		sensors &= ~((0) << 8);
			}
			else
			{
		sensors &= ~((1) << 11);
		sensors &= ~((1) << 10);
		sensors &= ~((1) << 9);
		sensors &= ~((1) << 8);
			}
				
		GBYP4= 0x00;
		}
		
