manoj153/STM32F1BOARD/Src/main.c
		if (((dipSW >> 4) & 1)) //CH3 BYP switch check to see to read the value or no
		{
			readChannel(3U);
		}
		else 
		{
				if (inverted)
				{
		sensors &= ~((0) << 15);
		sensors &= ~((0) << 14);
		sensors &= ~((0) << 13);
		sensors &= ~((0) << 12);
				}
				else 
				{
		sensors &= ~((1) << 15);
		sensors &= ~((1) << 14);
		sensors &= ~((1) << 13);
		sensors &= ~((1) << 12);
				}
				
				GBYP3= 0x00;
		}
		
		if (((dipSW >> 5) & 1)) //CH2 BYP switch check to see to read the value or no
		{
			readChannel(2U);
		}
		else 
		{
		if (inverted)
		{			
		sensors &= ~((0) << 19);
		sensors &= ~((0) << 18);
		sensors &= ~((0) << 17);
		sensors &= ~((0) << 16);
		}
		else
		{
		sensors &= ~((1) << 19);
		sensors &= ~((1) << 18);
		sensors &= ~((1) << 17);
		sensors &= ~((1) << 16);
		}
		
		GBYP2= 0x00;
		
		}
		
		if (((dipSW >> 6) & 1)) //CH1 BYP switch check to see to read the value or no
		{
			readChannel(1U);
		}
		else 
		{
		if (inverted)
		{
		sensors &= ~((0) << 23);
		sensors &= ~((0) << 22);
		sensors &= ~((0) << 21);
		sensors &= ~((0) << 20);
		}
		else
		{
		sensors &= ~((1) << 23);
		sensors &= ~((1) << 22);
		sensors &= ~((1) << 21);
		sensors &= ~((1) << 20);
		}
		
		GBYP1 = 0x00;
	}
		
		if (inverted)
		{
			sensors = (~sensors);
		}
		
		
		
		//Read AC-Fail A raw High is fail. So ~(LOW-BAD, HIGH Good)
		miscl &= ~(	HAL_GPIO_ReadPin(AC_FAIL_GPIO_Port,AC_FAIL_Pin) << 7); //bit 8 
		miscl &= ~(	HAL_GPIO_ReadPin(BATT_FAIL_GPIO_Port,BATT_FAIL_Pin) << 7); //bit 8 	
		miscl &= ~(	HAL_GPIO_ReadPin(CONN_FAIL_GPIO_Port,CONN_FAIL_Pin) << 6); //bit 8 
		miscl = (~miscl);
		switch(pointRorC)
    {
    	case 1:
				Cpymiscl = miscl;
				Cpysensors = sensors;
				pointRorC = 0;
    		break;
    	case 0:
			if(Cpymiscl != miscl)
			{
				PERMENANTMUTE = 1; buzzorNO = 1;
			}
			
			if(Cpysensors!= sensors)
			{
				PERMENANTMUTE = 1; buzzorNO = 1;
			}
			pointRorC = 1;
    		break;
    	default:
    		break;
    }

		splitbytes.bit_32 = sensors;
		
		
		HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_SET);
		for(uint8_t x = 0 ;x<4; x++)
      {
				if(x==0)
				{
					HAL_UART_Transmit(&huart2, txSE, 1, 150);
				}
				HAL_UART_Transmit(&huart2, &splitbytes.bytes[x], 1, 150);//{5-1,5-2,5-3,5-4,6-1,6-2,6-3,6-4}, {3-1,3-2-,3-3,3-4,4-1,4-2-4-3}
				
				if(x==3)
				{
					HAL_UART_Transmit(&huart2, &miscl, 1, 150);
					HAL_UART_Transmit(&huart2, &txSE[1], 1, 150);
				}
      }
//		if(slaveR == 'S')
//		{
//			
//			HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_SET);
//			
//		for(uint8_t x = 0 ;x<4; x++)
//      {
//				if(x==0)
//				{
//					HAL_UART_Transmit(&huart2, txSE, 1, 150);
//				}
//				HAL_UART_Transmit(&huart2, &splitbytes.bytes[x], 1, 150);//{5-1,5-2,5-3,5-4,6-1,6-2,6-3,6-4}, {3-1,3-2-,3-3,3-4,4-1,4-2-4-3}
//				
//				if(x==3)
//				{
//					HAL_UART_Transmit(&huart2, &miscl, 1, 150);
//					HAL_UART_Transmit(&huart2, &txSE[1], 1, 150);
//				}
//      }
//			HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_RESET);
//			slaveR = 0;
//		}
		HAL_Delay(500);
		offallLED();
		//_Bool logictest = ~(buzzorNO & PERMENANTMUTE);
		if(~(buzzorNO & PERMENANTMUTE)& 1) // Check if buzzer on/off, to delay
		{
			HAL_Delay(1000);
		}
		//if got change in  var disable permanent and mute.
		//Cpymiscl = miscl;
		trigger();
		
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* TIM1 init function */
static void MX_TIM1_Init(void)
{

  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim1.Instance = TIM1;
  htim1.Init.Prescaler = 4999;
  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim1.Init.Period = 1600;
  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;
  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* TIM4 init function */
static void MX_TIM4_Init(void)
{

  TIM_ClockConfigTypeDef sClockSourceConfig;
  TIM_MasterConfigTypeDef sMasterConfig;
  TIM_OC_InitTypeDef sConfigOC;

  htim4.Instance = TIM4;
  htim4.Init.Prescaler = 7;
  htim4.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim4.Init.Period = 250;
  htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim4) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim4, &sClockSourceConfig) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  if (HAL_TIM_PWM_Init(&htim4) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

